update the overview diagram of the  readme file
